{
	"Applicant": {
		"name": "Daniel Freire",
		"title": "Front End Developer",
		"email": "daniel.freire@gmx.com",
		"location": "Portugal"
	},

	"about": {
		"description": "Highly skilled Frontend Developer with nearly 2 years of experience in building responsive and dynamic user interfaces using React.js. Proficient in JavaScript, HTML, CSS, and experienced with TypeScript, Python, and Linux.
Committed to producing clean, efficient code and collaborating with cross- functional teams to deliver high-quality web applications."
	},

	"experience": [
		{
			"company": "Socialissimi",
			"position": "Frontend Developer",
			"start_date": "Jul. 2023 - Present",
			"summary": [
				"Spearheaded the development of over 30 reusable React.js components, reducing development effort by 40% across multiple projects.",
				"Enhanced front-end performance by implementing lazy loading and code splitting techniques, resulting in a 35% reduction in page load times and a 25% decrease in server load.",
				"Developed responsive and interactive web applications using advanced CSS techniques, ensuring compatibility across more than 95% of devices and screen sizes.",
				"Converted over 50 design layouts into code, ensuring pixel-perfect accuracy and fidelity to the original designs.",
				"Collaborated with cross-functional teams, including designers, backend developers, and project managers, to ensure seamless integration of React components across various projects."
			]
		},
		{
			"company": "Zany Marketing",
			"position": "Paid Media",
			"start_date": "Feb. 2020 - Jun. 2023",
			"summary": [
				"Conducted comprehensive keyword research, identifying over 100 high-value keywords for on-page optimization, which led to a 20% increase in organic traffic.",
				"Analyzed website traffic using Google Analytics, providing insights that informed data-driven marketing strategies and resulted in a 15% improvement in conversion rates.",
				"Optimized over 100 web pages in collaboration with content teams, enhancing user experience and SEO performance, which contributed to a 30% increase in page rankings."
			]
		}
	],

	"certifications": [
		{
			"title": "freeCodeCamp Certifications",
			"technologies": [
				"Responsive Web Design",
				"JavaScript Algorithms and Data Structures",
				"Scientific Computing with Python"
			]
		}
	],

	"skills": [
		{
			"name": "Programming Languages",
			"technologies": [
				"HTML5",
				"CSS3",
				"JavaScript",
				"React",
				"Webpack",
				"Python",
				"Linux"
			]
		},
		{
			"name": "Problem-Solving",
			"technologies": ["Problem-Solving"]
		},
		{
			"name": "Strategic Planning",
			"technologies": ["Strategic Planning"]
		},
		{
			"name": "Time Management",
			"technologies": ["Time Management"]
		}
	],

	"projects": [
		{
			"title": "Quizzical",
			"summary": [
				"Developed a Trivia Game web application with React.js serving a JSON API.",
				"Used reusable components to maintain style fidelity."
			],
			"technologies": [
				"JavaScript",
				"React.js"
			],
			"challenges": [
				"Storing API data efficiently",
				"Managing side effects with useEffect"
			]
		},
		{
			"title": "Tenzi",
			"summary": [
				"Leverages useState and useEffect React Hooks for user data storage and real-time updates",
				"Creates a fast-paced game that requires quick reflexes"
			],
			"technologies": [
				"useState and useEffect React Hooks",
				"React components and props"
			],
			"challenges": [
				"Storing user data efficiently",
				"Managing side effects with useEffect"
			]
		},
		{
			"title": "PollyGlot",
			"summary": [
				"Built a Translation web application that uses either OpenAI API or Gemini API for a few select languages."
			],
			"technologies": [
				"Gemini API", "OpenAI API", "TypeScript", "React.js"
			],
			"challenges": [
				"Building a scalable and interactive user interface",
				"Designed a fully responsive design without resorting to @media-queries."
			]
		}
	]
}
